In [1]:
import os
print(os.getcwd())
os.chdir('d:/Users/mokky/Documents/GitHub/NUS-ISS/IS02_PT_Capstone_Human_Re-ID')
print(os.getcwd())

d:\Users\mokky\Documents\GitHub\NUS-ISS\IS02_PT_Capstone_Human_Re-ID\reid\notebooks
d:\Users\mokky\Documents\GitHub\NUS-ISS\IS02_PT_Capstone_Human_Re-ID

In [2]:
import sqlite3
from src.database.database import DbQuery
import pandas as pd
import matplotlib.pyplot as plt
import cv2
import numpy as np

In [ ]:
db_path = 'reid/reid_db.db'
query = "SELECT name FROM sqlite_master WHERE type='table'"
conn = sqlite3.connect(db_path, detect_types=sqlite3.PARSE_DECLTYPES |
                       sqlite3.PARSE_COLNAMES)
cursor = conn.cursor()
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results)

                 name
0     sqlite_sequence
1      vectorkb_table
2     inference_table
3         human_table
4  correctlabel_table

In [ ]:
table_name = 'sqlite_sequence'
query = f'SELECT * FROM {table_name}'
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results.info())
display(qry_results.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    1 non-null      object
 1   seq     1 non-null      int64
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

None

              name    seq
0  inference_table  26179

In [20]:
table_name = 'vectorkb_table'
query = f'SELECT * FROM {table_name}'
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results.info())
display(qry_results.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1865 entries, 0 to 1864
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   img_id           1865 non-null   object
 1   img_path         1865 non-null   object
 2   img              1865 non-null   object
 3   vector_tensor    1865 non-null   object
 4   create_datetime  1865 non-null   object
dtypes: object(5)
memory usage: 73.0+ KB

None

,img_id,img_path,img,vector_tensor,create_datetime
0,16_XVKH_20210612T125929_30,TO BE REMOVED,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,b'\x80\x03ctorch._utils\n_rebuild_tensor_v2\nq...,2021-06-15 12:21:42
1,3_3OMW_20210612T125934_30,TO BE REMOVED,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,b'\x80\x03ctorch._utils\n_rebuild_tensor_v2\nq...,2021-06-15 12:21:42
2,3_P0ZK_20210612T125950_30,TO BE REMOVED,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,b'\x80\x03ctorch._utils\n_rebuild_tensor_v2\nq...,2021-06-15 12:21:43
3,3_GUB6_20210612T125956_30,TO BE REMOVED,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,b'\x80\x03ctorch._utils\n_rebuild_tensor_v2\nq...,2021-06-15 12:21:43
4,3_GUB6_20210612T130224_90,TO BE REMOVED,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,b'\x80\x03ctorch._utils\n_rebuild_tensor_v2\nq...,2021-06-15 12:21:43

In [15]:
table_name = 'inference_table'
query = f'SELECT * FROM {table_name}'
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results.info())
display(qry_results.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1865 entries, 0 to 1864
Data columns (total 13 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       1865 non-null   int64
 1   1       1865 non-null   object
 2   2       1865 non-null   object
 3   3       1183 non-null   object
 4   4       1864 non-null   object
 5   5       1864 non-null   float64
 6   6       1183 non-null   object
 7   7       1863 non-null   object
 8   8       1863 non-null   float64
 9   9       1183 non-null   object
 10  10      1862 non-null   object
 11  11      1862 non-null   float64
 12  12      1865 non-null   object
dtypes: float64(3), int64(1), object(9)
memory usage: 189.5+ KB

None

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,24315,16_XVKH_20210612T125929_30,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,None,NaN,None,None,NaN,None,None,NaN,2021-06-15 12:21:42
1,24316,3_3OMW_20210612T125934_30,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.211681,None,None,NaN,None,None,NaN,2021-06-15 12:21:42
2,24317,3_P0ZK_20210612T125950_30,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.630488,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.322684,None,None,NaN,2021-06-15 12:21:43
3,24318,3_GUB6_20210612T125956_30,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.503716,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.368630,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.215568,2021-06-15 12:21:43
4,24319,3_GUB6_20210612T130224_90,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.629281,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.356152,None,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x01\x00...,0.324396,2021-06-15 12:21:43

In [21]:
table_name = 'human_table'
query = f'SELECT * FROM {table_name}'
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results.info())
display(qry_results.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1865 entries, 0 to 1864
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   img_id              1865 non-null   object
 1   human_id            1865 non-null   object
 2   inference_datetime  1865 non-null   object
 3   type                1865 non-null   object
dtypes: object(4)
memory usage: 58.4+ KB

None

                       img_id human_id   inference_datetime type
0  16_XVKH_20210612T125929_30        1  2021-06-15 12:21:42  New
1   3_3OMW_20210612T125934_30        2  2021-06-15 12:21:42  New
2   3_P0ZK_20210612T125950_30        3  2021-06-15 12:21:43  New
3   3_GUB6_20210612T125956_30        4  2021-06-15 12:21:43  New
4   3_GUB6_20210612T130224_90        5  2021-06-15 12:21:43  New

In [22]:
table_name = 'correctlabel_table'
query = f'SELECT * FROM {table_name}'
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results.info())
display(qry_results.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1026 entries, 0 to 1025
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   img_id      1026 non-null   object
 1   is_correct  1026 non-null   int64
 2   human_id    1026 non-null   object
dtypes: int64(1), object(2)
memory usage: 24.2+ KB

None

                           img_id  is_correct human_id
0   11_2N45_20210613T125106_52500           1      255
1  11_3C3J_20210614T115035_109950           0      311
2   11_952R_20210613T122444_51780           1      255
3   11_BB5N_20210613T164609_61110           1      264
4   11_BB5N_20210613T164708_61140           1      264

In [23]:
table_name = 'correctlabel_table'
query = f'SELECT m.img_id AS img_id, m.is_correct AS is_correct, h.human_id AS human_id FROM {table_name} AS m'
query += " INNER JOIN human_table AS h ON h.img_id=m.img_id"
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results.head())
display(qry_results.nunique())
display(qry_results.human_id.unique())

                           img_id  is_correct human_id
0   11_2N45_20210613T125106_52500           1      255
1  11_3C3J_20210614T115035_109950           0      311
2   11_952R_20210613T122444_51780           1      255
3   11_BB5N_20210613T164609_61110           1      264
4   11_BB5N_20210613T164708_61140           1      264

img_id        1026
is_correct       2
human_id       231
dtype: int64

array(['255', '311', '264', '72', '78', '260', '324', '37', '38', '157',
       '160', '158', '334', '21', '19', '42', '43', '44', '47', '48',
       '20', '143', '144', '146', '284', '285', '87', '89', '335', '34',
       '114', '164', '9', '163', '15', '17', '10', '183', '282', '340',
       '33', '140', '207', '31', '233', '69', '4', '76', '2', '116',
       '167', '230', '5', '133', '306', '259', '139', '212', '128', '176',
       '94', '326', '327', '316', '168', '169', '124', '178', '225',
       '208', '152', '206', '123', '120', '129', '137', '203', '170',
       '119', '274', '277', '290', '303', '269', '217', '216', '93',
       '301', '23', '39', '300', '195', '8', '7', '98', '229', '232',
       '28', '196', '220', '313', '59', '60', '223', '247', '40', '150',
       '185', '100', '36', '112', '172', '245', '211', '134', '138',
       '320', '617', '547', '555', '508', '546', '507', '519', '523',
       '583', '569', '526', '594', '597', '521', '595', '568', '567',
       '625', '596', '551', '643', '653', '494', '497', '631', '633',
       '608', '645', '591', '615', '592', '634', '675', '627', '563',
       '632', '486', '613', '506', '502', '611', '552', '557', '670',
       '671', '672', '493', '496', '488', '649', '624', '663', '619',
       '639', '646', '621', '612', '562', '605', '513', '530', '345',
       '407', '405', '372', '389', '392', '402', '347', '348', '386',
       '357', '373', '375', '379', '427', '374', '477', '468', '470',
       '344', '391', '351', '449', '358', '455', '350', '451', '416',
       '445', '356', '346', '443', '462', '466', '452', '456', '458',
       '465', '442', '447', '459', '403', '404', '359', '444', '457',
       '436', '362', '435', '343', '437', '469', '453'], dtype=object)

In [37]:
db_path = 'database/reid_db_labelling (341-479)DC.db'
query = "SELECT name FROM sqlite_master WHERE type='table'"
conn_dc = sqlite3.connect(db_path, detect_types=sqlite3.PARSE_DECLTYPES |
                       sqlite3.PARSE_COLNAMES)
cursor_dc = conn_dc.cursor()
cursor_dc.execute(query)
column_names = [desc[0] for desc in cursor_dc.description]
qry_results_dc = pd.DataFrame(cursor_dc.fetchall(), columns=column_names)
print(qry_results_dc)
print(column_names)

                 name
0     sqlite_sequence
1      vectorkb_table
2     inference_table
3         human_table
4  correctlabel_table
['name']

In [38]:
table_name = 'correctlabel_table'
query = f'SELECT m.img_id AS img_id, m.is_correct AS is_correct, h.human_id AS human_id FROM {table_name} AS m'
query += " INNER JOIN human_table AS h ON h.img_id=m.img_id"
cursor_dc.execute(query)
column_names = [desc[0] for desc in cursor_dc.description]
print(column_names)
qry_results_dc = pd.DataFrame(cursor_dc.fetchall(), columns=column_names)
display(qry_results_dc.head())
display(qry_results_dc.nunique())
display(qry_results_dc.human_id.unique())

['img_id', 'is_correct', 'human_id']

                          img_id  is_correct human_id
0  11_2W41_20210614T060558_94380           1      345
1  11_2W41_20210614T060638_94410           1      345
2  11_2W41_20210614T060718_94440           1      345
3  11_2W41_20210614T060757_94470           1      345
4  11_CKF6_20210614T045857_91170           1      407

img_id        166
is_correct      2
human_id       53
dtype: int64

array(['345', '407', '405', '372', '389', '392', '402', '347', '348',
       '386', '357', '373', '375', '379', '427', '374', '477', '468',
       '470', '344', '391', '351', '449', '358', '455', '350', '451',
       '416', '445', '356', '346', '443', '462', '466', '452', '456',
       '458', '465', '442', '447', '459', '403', '404', '359', '444',
       '457', '436', '362', '435', '343', '437', '469', '453'],
      dtype=object)

In [39]:
#check if duplicate
display(qry_results_ys[qry_results_ys.img_id.isin(qry_results_dc.human_id.unique())])

Empty DataFrame
Columns: [img_id, is_correct, human_id]
Index: []

In [15]:
listMerge = [["347", "348"]]
df = pd.DataFrame({'merges': [','.join(item) for item in listMerge]})
print(df.info())
print(df)
with sqlite3.connect('database/reid_db_merging.db', detect_types=sqlite3.PARSE_DECLTYPES |
                     sqlite3.PARSE_COLNAMES) as conn:
    df.to_sql("merge_table", con=conn,
              index=False, if_exists='replace')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   merges  1 non-null      object
dtypes: object(1)
memory usage: 136.0+ bytes
None
    merges
0  347,348

In [17]:

listMerge = [["347", "348"]]
df = pd.DataFrame({'merges': [','.join(item) for item in listMerge]})
print([row[0].split(',') for _, row in df.iterrows()])

[['347', '348']]

In [25]:
db_path = 'database/reid_db_merging.db'
query = "SELECT name FROM sqlite_master WHERE type='table'"
conn = sqlite3.connect(db_path, detect_types=sqlite3.PARSE_DECLTYPES |
                          sqlite3.PARSE_COLNAMES)
cursor = conn.cursor()
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
print(qry_results)
print(column_names)

Empty DataFrame
Columns: [name]
Index: []
['name']

In [26]:
table_name = 'merge_table'
query = f'SELECT * FROM {table_name}'
cursor.execute(query)
column_names = [desc[0] for desc in cursor.description]
print(column_names)
qry_results = pd.DataFrame(cursor.fetchall(), columns=column_names)
display(qry_results.head())

OperationalError: no such table: merge_table